## The TMDb database

I will be exploring [The Movie Database](https://www.themoviedb.org/) – an online movie and TV show database that houses some of the most popular movies and TV shows at your fingertips. The TMDb database supports 39 official languages used in over 180 countries daily and dates back all the way to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship Diagram (ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ERD, the TMDb database consists of `12 tables` containing information about movies, cast, genre, and so much more.  

Let's get started!

In [23]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
# Establish a connection to the local database using the '%sql' magic command.

%sql sqlite:///TMDB.db

'Connected: @TMDB.db'

### Question 1

Who won the Oscar for “Actor in a Leading Role” in  2015?

(Hint: The winner is indicated as '1.0'.)

In [34]:
%%sql

SELECT
    *
FROM
    OSCARS
WHERE
    year = 2015 AND
    award = 'Actor in a Leading Role' AND
    winner = '1.0';

 * sqlite:///TMDB.db
Done.

[('2015', 'Actor in a Leading Role', '1.0', 'Leonardo DiCaprio', 'The Revenant')]

### Question 2

What are the ten oldest movies in the database?

In [45]:
%%sql

SELECT
    movie_id,
    title,
    release_date
FROM
    movies
WHERE 
    release_date IS NOT NULL
ORDER BY
    release_date asc
limit 10;

 * sqlite:///TMDB.db
Done.

[(3059, 'Intolerance', '1916-09-04 00:00:00.000000'),
 (3060, 'The Big Parade', '1925-11-05 00:00:00.000000'),
 (19, 'Metropolis', '1927-01-10 00:00:00.000000'),
 (905, "Pandora's Box", '1929-01-30 00:00:00.000000'),
 (65203, 'The Broadway Melody', '1929-02-08 00:00:00.000000'),
 (22301, "Hell's Angels", '1930-11-15 00:00:00.000000'),
 (22649, 'A Farewell to Arms', '1932-12-08 00:00:00.000000'),
 (3062, '42nd Street', '1933-02-02 00:00:00.000000'),
 (43595, 'She Done Him Wrong', '1933-02-09 00:00:00.000000'),
 (3078, 'It Happened One Night', '1934-02-22 00:00:00.000000')]

### Question 3

How many unique awards are there in the Oscars table?

In [68]:
%%sql

SELECT 
    count(distinct award) as unique_awards
FROM
    oscars;

 * sqlite:///TMDB.db
Done.

[(114,)]

### Question 4

How many movies are there that contain the word “Spider” within their title?

In [74]:
%%sql

SELECT
    count(title) as movies_with_spider
FROM
    movies
WHERE
    title like '%Spider%';

 * sqlite:///TMDB.db
Done.

[(9,)]

### Question 5

How many movies are there that are both in the "Thriller" genre and contain the word “love” anywhere in the keywords?

In [95]:
%%sql

SELECT
    *
FROM
    keyword
limit 5;

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: keyword
[SQL: SELECT
    *
FROM
    keyword as key
limit 5;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)